In [6]:
import pandas as pd
import numpy as np

# Persiapan Data Frame

In [7]:
n_rows = 5
n_cols = 2
cols = ['omset', 'operasional']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)),
                 columns = cols)
df

   omset  operasional
0      9            6
1      2           17
2      6           11
3      8            4
4     12            7

In [8]:
df['omset'] = df['omset'] * 100_000
df['operasional'] = df['operasional'] * 10_000
df

     omset  operasional
0   900000        60000
1   200000       170000
2   600000       110000
3   800000        40000
4  1200000        70000

In [9]:
df.index = pd.util.testing.makeDateIndex(n_rows, freq = 'D')
df = df.reset_index()
df = df.rename(columns={'index':'tanggal'})
df

F:\Anaconda\lib\site-packages\pandas\util\__init__.py:15: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

     tanggal    omset  operasional
0 2000-01-01   900000        60000
1 2000-01-02   200000       170000
2 2000-01-03   600000       110000
3 2000-01-04   800000        40000
4 2000-01-05  1200000        70000

# Melakukan formatting tampilan Data Frame

In [10]:
formatku = {'tanggal': '{:%d/%m/%y}',
           'operasional':'Rp {:.2f}',
           'omset': 'Rp {:.2f}'}

laporan = df.style.format(formatku)
laporan

In [11]:
type(laporan)

pandas.io.formats.style.Styler

In [14]:
laporan.hide_index()

In [15]:
laporan.set_caption('Data Omset dan Operasional')

In [16]:
laporan.highlight_min('omset', color='pink')
laporan.highlight_max('omset', color='lightgreen')

laporan.highlight_min('operasional', color='lightblue')
laporan.highlight_max('operasional', color='grey')